morse = {'A': '.- ', 'B': '-... ', 'C': '-.-. ',
         'D': '-.. ', 'E': '. ', 'F': '..-. ',
         'G': '--. ', 'H': '.... ', 'I': '.. ',
         'J': '.--- ', 'K': '-.- ', 'L': '.-.. ',
         'M': '-- ', 'N': '-. ', 'O': '--- ',
         'P': '.--. ', 'Q': '--.- ', 'R': '.-. ',
         'S': '... ', 'T': '- ', 'U': '..- ',
         'V': '...- ', 'W': '.-- ', 'X': '-..- ',
         'Y': '-.-- ', 'Z': '--.. ', ' ': '\t',
         }

reverse_morse = {'.-': 'A', '-...': 'B', '-.-.': 'C', '-..': 'D',
                 '.': 'E', '..-.': 'F', '--.': 'G', '....': 'H',
                 '..': 'I', '.---': 'J', '-.-': 'K', '.-..': 'L',
                 '--': 'M', '-.': 'N', '---': 'O', '.--.': 'P',
                 '--.-': 'Q', '.-.': 'R', '...': 'S', '-': 'T',
                 '..-': 'U', '...-': 'V', '.--': 'W', '-..-': 'X',
                 '-.--': 'Y', '--..': 'Z', '\t': ' '}


def encode_to_morse(text):
    for i in text:
        print(morse[i.upper()], end='')


def decode_from_morse(cod):
    cod = cod.replace('\t', ' %%% ').split()
    for i in cod:
        print(reverse_morse.get(i, ' '), end='')


def main():
    print('Вы хотите закодировать - 1 или раскодировать текст - 2?')
    n = input()
    while n:
        if n == '1':
            print('Введите текст заглавными английскими буквами')
            encode_to_morse(input())
            break
        elif n == '2':
            print('Введите код')
            decode_from_morse(input())
            break
        print('Вы хотите закодировать - 1 или раскодировать текст - 2?')
        n = input()


main()
